remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/components/ethernet_phy/ksz8851snl/ksz8851snl_reg.h
/**
 *
 * \file
 *
 * \brief KS8851SNL registers definitions.
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef KSZ8851SNL_REG_H_INCLUDED
#define KSZ8851SNL_REG_H_INCLUDED

#define REG_ADDR_MASK              0x3F0      /* Register address mask */
#define OPCODE_MASK                (3 << 14)
#define CMD_READ                   (0 << 14)
#define CMD_WRITE                  (1 << 14)
#define FIFO_READ                  0x80
#define FIFO_WRITE                 0xC0

/*
 * MAC Registers
 * (Offset 0x00 - 0x25)
 */
#define REG_BUS_ERROR_STATUS       0x06       /* BESR */
#define   BUS_ERROR_IBEC              0x8000
#define   BUS_ERROR_IBECV_MASK        0x7800    /* Default IPSec clock at 166Mhz */

#define REG_CHIP_CFG_STATUS        0x08       /* CCFG */
#define   LITTLE_ENDIAN_BUS_MODE      0x0400    /* Bus in little endian mode */
#define   EEPROM_PRESENCE             0x0200    /* External EEPROM is used */
#define   SPI_BUS_MODE                0x0100    /* In SPI bus mode */
#define   DATA_BUS_8BIT               0x0080    /* In 8-bit bus mode operation */
#define   DATA_BUS_16BIT              0x0040    /* In 16-bit bus mode operation */
#define   DATA_BUS_32BIT              0x0020    /* In 32-bit bus mode operation */
#define   MULTIPLEX_MODE              0x0010    /* Data and address bus are shared */
#define   CHIP_PACKAGE_128PIN         0x0008    /* 128-pin package */
#define   CHIP_PACKAGE_80PIN          0x0004    /* 80-pin package */
#define   CHIP_PACKAGE_48PIN          0x0002    /* 48-pin package */
#define   CHIP_PACKAGE_32PIN          0x0001    /* 32-pin package for SPI host interface only */

#define REG_MAC_ADDR_0             0x10       /* MARL */
#define REG_MAC_ADDR_1             0x11       /* MARL */
#define REG_MAC_ADDR_2             0x12       /* MARM */
#define REG_MAC_ADDR_3             0x13       /* MARM */
#define REG_MAC_ADDR_4             0x14       /* MARH */
#define REG_MAC_ADDR_5             0x15       /* MARH */

#define REG_BUS_CLOCK_CTRL         0x20       /* OBCR */
#define   BUS_CLOCK_166               0x0004    /* 166 MHz on-chip bus clock (defaul is 125MHz) */
#define   BUS_CLOCK_DIVIDEDBY_5       0x0003    /* Bus clock devided by 5 */
#define   BUS_CLOCK_DIVIDEDBY_3       0x0002    /* Bus clock devided by 3 */
#define   BUS_CLOCK_DIVIDEDBY_2       0x0001    /* Bus clock devided by 2 */
#define   BUS_CLOCK_DIVIDEDBY_1       0x0000    /* Bus clock devided by 1 */
#define   BUS_CLOCK_DIVIDED_MASK      0x0003    /* Bus clock devider mask */

#define   BUS_SPEED_166_MHZ           0x0004    /* Set bus speed to 166 MHz */
#define   BUS_SPEED_125_MHZ           0x0000    /* Set bus speed to 125 MHz */
#define   BUS_SPEED_83_MHZ            0x0005    /* Set bus speed to 83 MHz (166/2)*/
#define   BUS_SPEED_62_5_MHZ          0x0001    /* Set bus speed to 62.5 MHz (125/2) */
#define   BUS_SPEED_53_3_MHZ          0x0006    /* Set bus speed to 53.3 MHz (166/3) */
#define   BUS_SPEED_41_7_MHZ          0x0002    /* Set bus speed to 41.67 MHz (125/3) */
#define   BUS_SPEED_33_2_MHZ          0x0007    /* Set bus speed to 33.2 MHz (166/5) */
#define   BUS_SPEED_25_MHZ            0x0003    /* Set bus speed to 25 MHz (125/5) */

#define REG_EEPROM_CTRL            0x22       /* EEPCR */
#define   EEPROM_ACCESS_ENABLE        0x0010    /* Enable software to access EEPROM through bit 3 to bit 0 */
#define   EEPROM_DATA_IN              0x0008    /* Data receive from EEPROM (EEDI pin) */
#define   EEPROM_DATA_OUT             0x0004    /* Data transmit to EEPROM (EEDO pin) */
#define   EEPROM_SERIAL_CLOCK         0x0002    /* Serial clock (EESK pin) */
#define   EEPROM_CHIP_SELECT          0x0001    /* EEPROM chip select (EECS pin) */

#define REG_MEM_BIST_INFO          0x24       /* MBIR */
#define   TX_MEM_TEST_FINISHED        0x1000    /* TX memeory BIST test finish */
#define   TX_MEM_TEST_FAILED          0x0800    /* TX memory BIST test fail */
#define   TX_MEM_TEST_FAILED_COUNT    0x0700    /* TX memory BIST test fail count */
#define   RX_MEM_TEST_FINISHED        0x0010    /* RX memory BIST test finish */
#define   RX_MEM_TEST_FAILED          0x0008    /* RX memory BIST test fail */
#define   RX_MEM_TEST_FAILED_COUNT    0x0003    /* RX memory BIST test fail count */

#define REG_RESET_CTRL             0x26       /* GRR */
#define   QMU_SOFTWARE_RESET          0x0002    /* QMU soft reset (clear TxQ, RxQ) */
#define   GLOBAL_SOFTWARE_RESET       0x0001    /* Global soft reset (PHY, MAC, QMU) */

/*
 * Wake On Lan Control Registers
 * (Offset 0x2A - 0x6B)
 */
#define REG_WOL_CTRL               0x2A       /* WFCR */
#define   WOL_MAGIC_ENABLE            0x0080    /* Enable the magic packet pattern detection */
#define   WOL_FRAME3_ENABLE           0x0008    /* Enable the wake up frame 3 pattern detection */
#define   WOL_FRAME2_ENABLE           0x0004    /* Enable the wake up frame 2 pattern detection */
#define   WOL_FRAME1_ENABLE           0x0002    /* Enable the wake up frame 1 pattern detection */
#define   WOL_FRAME0_ENABLE           0x0001    /* Enable the wake up frame 0 pattern detection */

#define REG_WOL_FRAME0_CRC0        0x30       /* WF0CRC0 */
#define REG_WOL_FRAME0_CRC1        0x32       /* WF0CRC1 */
#define REG_WOL_FRAME0_BYTE_MASK0  0x34       /* WF0BM0 */
#define REG_WOL_FRAME0_BYTE_MASK1  0x36       /* WF0BM1 */
#define REG_WOL_FRAME0_BYTE_MASK2  0x38       /* WF0BM2 */
#define REG_WOL_FRAME0_BYTE_MASK3  0x3A       /* WF0BM3 */

#define REG_WOL_FRAME1_CRC0        0x40       /* WF1CRC0 */
#define REG_WOL_FRAME1_CRC1        0x42       /* WF1CRC1 */
#define REG_WOL_FRAME1_BYTE_MASK0  0x44       /* WF1BM0 */
#define REG_WOL_FRAME1_BYTE_MASK1  0x46       /* WF1BM1 */
#define REG_WOL_FRAME1_BYTE_MASK2  0x48       /* WF1BM2 */
#define REG_WOL_FRAME1_BYTE_MASK3  0x4A       /* WF1BM3 */

#define REG_WOL_FRAME2_CRC0        0x50       /* WF2CRC0 */
#define REG_WOL_FRAME2_CRC1        0x52       /* WF2CRC1 */
#define REG_WOL_FRAME2_BYTE_MASK0  0x54       /* WF2BM0 */
#define REG_WOL_FRAME2_BYTE_MASK1  0x56       /* WF2BM1 */
#define REG_WOL_FRAME2_BYTE_MASK2  0x58       /* WF2BM2 */
#define REG_WOL_FRAME2_BYTE_MASK3  0x5A       /* WF2BM3 */

#define REG_WOL_FRAME3_CRC0        0x60       /* WF3CRC0 */
#define REG_WOL_FRAME3_CRC1        0x62       /* WF3CRC1 */
#define REG_WOL_FRAME3_BYTE_MASK0  0x64       /* WF3BM0 */
#define REG_WOL_FRAME3_BYTE_MASK1  0x66       /* WF3BM1 */
#define REG_WOL_FRAME3_BYTE_MASK2  0x68       /* WF3BM2 */
#define REG_WOL_FRAME3_BYTE_MASK3  0x6A       /* WF3BM3 */

