remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/components/ethernet_phy/ksz8851snl/ksz8851snl_reg.h
#define REG_TX_ADDR_PTR            0x84       /* TXFDPR */
#define REG_RX_ADDR_PTR            0x86       /* RXFDPR */
#define   ADDR_PTR_AUTO_INC           0x4000    /* Enable Frame data pointer increments automatically */
#define   ADDR_PTR_MASK               0x03ff    /* Address pointer mask */

#define REG_RX_TIME_THRES          0x8C       /* RXDTTR */
#define   RX_TIME_THRESHOLD_MASK      0xFFFF    /* Set receive timer duration threshold */

#define REG_RX_BYTE_CNT_THRES      0x8E       /* RXDBCTR */
#define   RX_BYTE_THRESHOLD_MASK      0xFFFF    /* Set receive byte count threshold */

#define REG_INT_MASK               0x90       /* IER */
#define   INT_PHY                     0x8000    /* Enable link change interrupt */
#define   INT_TX                      0x4000    /* Enable transmit done interrupt */
#define   INT_RX                      0x2000    /* Enable receive interrupt */
#define   INT_RX_OVERRUN              0x0800    /* Enable receive overrun interrupt */
#define   INT_TX_STOPPED              0x0200    /* Enable transmit process stopped interrupt */
#define   INT_RX_STOPPED              0x0100    /* Enable receive process stopped interrupt */
#define   INT_TX_SPACE                0x0040    /* Enable transmit space available interrupt */
#define   INT_RX_WOL_FRAME            0x0020    /* Enable WOL on receive wake-up frame detect interrupt */
#define   INT_RX_WOL_MAGIC            0x0010    /* Enable WOL on receive magic packet detect interrupt */
#define   INT_RX_WOL_LINKUP           0x0008    /* Enable WOL on link up detect interrupt */
#define   INT_RX_WOL_ENERGY           0x0004    /* Enable WOL on energy detect interrupt */
#define   INT_RX_SPI_ERROR            0x0002    /* Enable receive SPI bus error interrupt */
#define   INT_RX_WOL_DELAY_ENERGY     0x0001    /* Enable WOL on delay energy detect interrupt */
#define   INT_MASK                    ( INT_RX | INT_TX | INT_PHY )

#define REG_INT_STATUS             0x92       /* ISR */

#define REG_RX_FRAME_CNT_THRES     0x9C       /* RXFCTFC */
#define   RX_FRAME_CNT_MASK           0xFF00    /* Received frame count mask */
#define   RX_FRAME_THRESHOLD_MASK     0x00FF    /* Set receive frame count threshold mask */

#define REG_TX_TOTAL_FRAME_SIZE    0x9E       /* TXNTFSR */
#define   TX_TOTAL_FRAME_SIZE_MASK    0xFFFF    /* Set next total tx frame size mask */

/*
 * MAC Address Hash Table Control Registers
 * (Offset 0xA0 - 0xA7)
 */
#define REG_MAC_HASH_0             0xA0       /* MAHTR0 */
#define REG_MAC_HASH_1             0xA1

#define REG_MAC_HASH_2             0xA2       /* MAHTR1 */
#define REG_MAC_HASH_3             0xA3

#define REG_MAC_HASH_4             0xA4       /* MAHTR2 */
#define REG_MAC_HASH_5             0xA5

#define REG_MAC_HASH_6             0xA6       /* MAHTR3 */
#define REG_MAC_HASH_7             0xA7

/*
 * QMU Receive Queue Watermark Control Registers
 * (Offset 0xB0 - 0xB5)
 */
#define REG_RX_LOW_WATERMARK       0xB0       /* FCLWR */
#define   RX_LOW_WATERMARK_MASK       0x0FFF    /* Set QMU RxQ low watermark mask */

#define REG_RX_HIGH_WATERMARK      0xB2       /* FCHWR */
#define   RX_HIGH_WATERMARK_MASK      0x0FFF    /* Set QMU RxQ high watermark mask */

#define REG_RX_OVERRUN_WATERMARK   0xB4       /* FCOWR */
#define   RX_OVERRUN_WATERMARK_MASK   0x0FFF    /* Set QMU RxQ overrun watermark mask */

/*
 * Global Control Registers
 * (Offset 0xC0 - 0xD3)
 */
#define REG_CHIP_ID                0xC0       /* CIDER */
#define   CHIP_ID_MASK                0xFFF0     /* Family ID and chip ID mask */
#define   REVISION_MASK               0x000E     /* Chip revision mask */
#define   CHIP_ID_SHIFT               4
#define   REVISION_SHIFT              1
#define   CHIP_ID_8851_16             0x8870     /* KS8851-16/32MQL chip ID */

#define REG_LED_CTRL               0xC6       /* CGCR */
#define   LED_CTRL_SEL1               0x8000     /* Select LED3/LED2/LED1/LED0 indication */
#define   LED_CTRL_SEL0               0x0200     /* Select LED3/LED2/LED1/LED0 indication */

#define REG_IND_IACR               0xC8       /* IACR */
#define   TABLE_READ                  0x1000     /* Indirect read */
#define   TABLE_MIB                   0x0C00     /* Select MIB counter table */
#define   TABLE_ENTRY_MASK            0x001F     /* Set table entry to access */

#define REG_IND_DATA_LOW           0xD0       /* IADLR */
#define REG_IND_DATA_HIGH          0xD2       /* IADHR */

/*
 * Power Management Control Registers
 * (Offset 0xD4 - 0xD7)
 */
#define REG_POWER_CNTL             0xD4       /* PMECR */
#define   PME_DELAY_ENABLE            0x4000    /* Enable the PME output pin assertion delay */
#define   PME_ACTIVE_HIGHT            0x1000    /* PME output pin is active high */
#define   PME_FROM_WKFRAME            0x0800    /* PME asserted when wake-up frame is detected */
#define   PME_FROM_MAGIC              0x0400    /* PME asserted when magic packet is detected */
#define   PME_FROM_LINKUP             0x0200    /* PME asserted when link up is detected */
#define   PME_FROM_ENERGY             0x0100    /* PME asserted when energy is detected */
#define   PME_EVENT_MASK              0x0F00    /* PME asserted event mask */
#define   WAKEUP_AUTO_ENABLE          0x0080    /* Enable auto wake-up in energy mode */
#define   WAKEUP_NORMAL_AUTO_ENABLE   0x0040    /* Enable auto goto normal mode from energy detecion mode */
#define   WAKEUP_FROM_WKFRAME         0x0020    /* Wake-up from wake-up frame event detected */
#define   WAKEUP_FROM_MAGIC           0x0010    /* Wake-up from magic packet event detected */
#define   WAKEUP_FROM_LINKUP          0x0008    /* Wake-up from link up event detected */
#define   WAKEUP_FROM_ENERGY          0x0004    /* Wake-up from energy event detected */
#define   WAKEUP_EVENT_MASK           0x003C    /* Wake-up event mask */
#define   POWER_STATE_D1              0x0003    /* Power saving mode */
#define   POWER_STATE_D3              0x0002    /* Power down mode */
#define   POWER_STATE_D2              0x0001    /* Power detection mode */
#define   POWER_STATE_D0              0x0000    /* Normal operation mode (default) */
#define   POWER_STATE_MASK            0x0003    /* Power management mode mask */

#define REG_WAKEUP_TIME            0xD6       /* GSWUTR */
#define   WAKEUP_TIME                 0xFF00    /* Min time (sec) wake-uo after detected energy */
#define   GOSLEEP_TIME                0x00FF    /* Min time (sec) before goto sleep when in energy mode */

