remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/components/ethernet_phy/ksz8851snl/ksz8851snl_reg.h
/*
 * PHY Control Registers
 * (Offset 0xD8 - 0xF9)
 */
#define REG_PHY_RESET              0xD8       /* PHYRR */
#define   PHY_RESET                   0x0001    /* Reset PHY */

#define REG_PHY_CNTL               0xE4       /* P1MBCR */
#define   PHY_SPEED_100MBIT           0x2000     /* Force PHY 100Mbps */
#define   PHY_AUTO_NEG_ENABLE         0x1000     /* Enable PHY auto-negotiation */
#define   PHY_POWER_DOWN              0x0800     /* Set PHY power-down */
#define   PHY_AUTO_NEG_RESTART        0x0200     /* Restart PHY auto-negotiation */
#define   PHY_FULL_DUPLEX             0x0100     /* Force PHY in full duplex mode */
#define   PHY_HP_MDIX                 0x0020     /* Set PHY in HP auto MDI-X mode */
#define   PHY_FORCE_MDIX              0x0010     /* Force MDI-X */
#define   PHY_AUTO_MDIX_DISABLE       0x0008     /* Disable auto MDI-X */
#define   PHY_TRANSMIT_DISABLE        0x0002     /* Disable PHY transmit */
#define   PHY_LED_DISABLE             0x0001     /* Disable PHY LED */

#define REG_PHY_STATUS             0xE6       /* P1MBSR */
#define   PHY_100BT4_CAPABLE          0x8000     /* 100 BASE-T4 capable */
#define   PHY_100BTX_FD_CAPABLE       0x4000     /* 100BASE-TX full duplex capable */
#define   PHY_100BTX_CAPABLE          0x2000     /* 100BASE-TX half duplex capable */
#define   PHY_10BT_FD_CAPABLE         0x1000     /* 10BASE-TX full duplex capable */
#define   PHY_10BT_CAPABLE            0x0800     /* 10BASE-TX half duplex capable */
#define   PHY_AUTO_NEG_ACKNOWLEDGE    0x0020     /* Auto-negotiation complete */
#define   PHY_AUTO_NEG_CAPABLE        0x0008     /* Auto-negotiation capable */
#define   PHY_LINK_UP                 0x0004     /* PHY link is up */
#define   PHY_EXTENDED_CAPABILITY     0x0001     /* PHY extended register capable */

#define REG_PHY_ID_LOW             0xE8       /* PHY1ILR */
#define REG_PHY_ID_HIGH            0xEA       /* PHY1IHR */

#define REG_PHY_AUTO_NEGOTIATION   0xEC       /* P1ANAR */
#define   PHY_AUTO_NEG_SYM_PAUSE      0x0400     /* Advertise pause capability */
#define   PHY_AUTO_NEG_100BTX_FD      0x0100     /* Advertise 100 full-duplex capability */
#define   PHY_AUTO_NEG_100BTX         0x0080     /* Advertise 100 half-duplex capability */
#define   PHY_AUTO_NEG_10BT_FD        0x0040     /* Advertise 10 full-duplex capability */
#define   PHY_AUTO_NEG_10BT           0x0020     /* Advertise 10 half-duplex capability */
#define   PHY_AUTO_NEG_SELECTOR       0x001F     /* Selector field mask */
#define   PHY_AUTO_NEG_802_3          0x0001     /* 802.3 */

#define REG_PHY_REMOTE_CAPABILITY  0xEE       /* P1ANLPR */
#define   PHY_REMOTE_SYM_PAUSE        0x0400     /* Link partner pause capability */
#define   PHY_REMOTE_100BTX_FD        0x0100     /* Link partner 100 full-duplex capability */
#define   PHY_REMOTE_100BTX           0x0080     /* Link partner 100 half-duplex capability */
#define   PHY_REMOTE_10BT_FD          0x0040     /* Link partner 10 full-duplex capability */
#define   PHY_REMOTE_10BT             0x0020     /* Link partner 10 half-duplex capability */

#define REG_PORT_LINK_MD           0xF4       /* P1SCLMD */
#define   PORT_CABLE_10M_SHORT        0x8000     /* Cable length is less than 10m short */
#define   PORT_CABLE_STAT_FAILED      0x6000     /* Cable diagnostic test fail */
#define   PORT_CABLE_STAT_SHORT       0x4000     /* Short condition detected in the cable */
#define   PORT_CABLE_STAT_OPEN        0x2000     /* Open condition detected in the cable */
#define   PORT_CABLE_STAT_NORMAL      0x0000     /* Normal condition */
#define   PORT_CABLE_DIAG_RESULT      0x6000     /* Cable diagnostic test result mask */
#define   PORT_START_CABLE_DIAG       0x1000     /* Enable cable diagnostic test */
#define   PORT_FORCE_LINK             0x0800     /* Enable force link pass */
#define   PORT_POWER_SAVING           0x0400     /* Disable power saving */
#define   PORT_REMOTE_LOOPBACK        0x0200     /* Enable remote loopback at PHY */
#define   PORT_CABLE_FAULT_COUNTER    0x01FF     /* Cable length distance to the fault */

#define REG_PORT_CTRL              0xF6       /* P1CR */
#define   PORT_LED_OFF                0x8000     /* Turn off all the port LEDs (LED3/LED2/LED1/LED0) */
#define   PORT_TX_DISABLE             0x4000     /* Disable port transmit */
#define   PORT_AUTO_NEG_RESTART       0x2000     /* Restart auto-negotiation */
#define   PORT_POWER_DOWN             0x0800     /* Set port power-down */
#define   PORT_AUTO_MDIX_DISABLE      0x0400     /* Disable auto MDI-X */
#define   PORT_FORCE_MDIX             0x0200     /* Force MDI-X */
#define   PORT_AUTO_NEG_ENABLE        0x0080     /* Enable auto-negotiation */
#define   PORT_FORCE_100_MBIT         0x0040     /* Force PHY 100Mbps */
#define   PORT_FORCE_FULL_DUPLEX      0x0020     /* Force PHY in full duplex mode */
#define   PORT_AUTO_NEG_SYM_PAUSE     0x0010     /* Advertise pause capability */
#define   PORT_AUTO_NEG_100BTX_FD     0x0008     /* Advertise 100 full-duplex capability */
#define   PORT_AUTO_NEG_100BTX        0x0004     /* Advertise 100 half-duplex capability */
#define   PORT_AUTO_NEG_10BT_FD       0x0002     /* Advertise 10 full-duplex capability */
#define   PORT_AUTO_NEG_10BT          0x0001     /* Advertise 10 half-duplex capability */

#define REG_PORT_STATUS            0xF8       /* P1SR */
#define   PORT_HP_MDIX                0x8000     /* Set PHY in HP auto MDI-X mode */
#define   PORT_REVERSED_POLARITY      0x2000     /* Polarity is reversed */
#define   PORT_RX_FLOW_CTRL           0x1000     /* Reeive flow control feature is active */
#define   PORT_TX_FLOW_CTRL           0x0800     /* Transmit flow control feature is active */
#define   PORT_STAT_SPEED_100MBIT     0x0400     /* Link is 100Mbps */
#define   PORT_STAT_FULL_DUPLEX       0x0200     /* Link is full duplex mode */
#define   PORT_MDIX_STATUS            0x0080     /* Is MDI */
#define   PORT_AUTO_NEG_COMPLETE      0x0040     /* Auto-negotiation complete */
#define   PORT_STATUS_LINK_GOOD       0x0020     /* PHY link is up */
#define   PORT_REMOTE_SYM_PAUSE       0x0010     /* Link partner pause capability */
#define   PORT_REMOTE_100BTX_FD       0x0008     /* Link partner 100 full-duplex capability */
#define   PORT_REMOTE_100BTX          0x0004     /* Link partner 100 half-duplex capability */
#define   PORT_REMOTE_10BT_FD         0x0002     /* Link partner 10 full-duplex capability */
#define   PORT_REMOTE_10BT            0x0001     /* Link partner 10 half-duplex capability */

#endif /* KSZ8851SNL_REG_H_INCLUDED */
